# 2290 LCDTest
# 숫자 하나는 
#  --
# |  |
# |  |
#  --
# |  |
# |  |
#  --   -> 7*4

# s = 1
# s+2 * 2s+3
# 3*5
#  - 
# | |
#  - 
# | |
#  -    -> 세그먼트는 8개 

# 0 => [0][1~s+2-2]
# 1 => [1~ 2s+3 // 2 -1][0]
# 2 => [1~ 2s+3 // 2 -1][s+2-1]
# 3 => [2s+3 // 2][1~s+2-2]
# 4 => [2s+3 //2 +1 ~ 2s+3 -2][0]
# 5 => [2s+3 //2 +1 ~ 2s+3 -2][s+2-1]
# 6 => [2s+3-1][1~s+2-2]

s,n = input().split()

s, n = int(s), list(map(int,list(n)))
for row in range(2*s+3):
    r = ''
    for idx in range(len(n)):
        if row == 0 :
            if n[idx] in [2,3,5,6,7,8,9,0]:
                r+=' '+ ('-'*s) +' '
            else:
                r+=' '*(s+2)
        elif row > 0 and row <= (2*s+3)//2 -1:
            if  n[idx] in [5,6]: # 왼쪽
                r+='|'+ ' '*(s+1)
            elif n[idx] in [1,2,3,7]: # 오른쪽
                r+=' '*(s+1)+'|'
            else:
                r+='|'+ (' '*s) +'|'
        elif row == (2*s+3)//2:
            if n[idx] in [2,3,4,5,6,8,9]:
                r+=' '+ ('-'*s) +' '
            else:
                r+=' '*(s+2)
        elif row > (2*s+3)//2 and row < 2*s+3 -1:
            if  n[idx] in [2]: # 왼쪽
                r+='|'+ ' '*(s+1)
            elif n[idx] in [1,3,4,5,7,9]: # 오른쪽
                r+=' '*(s+1)+'|'
            else:
                r+='|'+ (' '*s) +'|'
        else:
            if n[idx] in [2,3,5,6,8,9,0]:
                r+=' '+ ('-'*s) +' '
            else:
                r+=' '*(s+2)
    
        r+=' '

    print(r)



